Xcping2013/mySTM32F_MDK/STM32F_STD/INC-MB1616007_MDK/Device_drivers/myDrivers/motion/cspin/cspin1.h
/**
  ******************************************************************************
  * @file    cSPIN.h 
  * @author  IPC Rennes
  * @version V2.1
  * @date    October 15, 2013
  * @brief   Header for cspin.c module
  * @note    (C) COPYRIGHT 2013 STMicroelectronics
  ******************************************************************************
  * @copy
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  */ 

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __CSPIN_H
#define __CSPIN_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "cspin_config.h"

/* Exported constants --------------------------------------------------------*/

/** @defgroup cSPIN FW library interface
  *
  * {
  */

#define FALSE (0)
#define TRUE  (1)


#ifdef STEVAL_PCC009V2
	#define cSPIN_SPI			SPI2
	
	#define cSPIN_SCK_Pin		GPIO_Pin_13
	#define cSPIN_SCK_Port		GPIOB
	
	#define cSPIN_MOSI_Pin		GPIO_Pin_15
	#define cSPIN_MOSI_Port		GPIOB
	
	#define cSPIN_MISO_Pin		GPIO_Pin_14
	#define cSPIN_MISO_Port		GPIOB
	
	#define cSPIN_nSS_Pin		GPIO_Pin_12
	#define cSPIN_nSS_Port		GPIOB
	
	#define cSPIN_BUSY_Pin		GPIO_Pin_10
	#define cSPIN_BUSY_Port		GPIOB
	
	#define cSPIN_FLAG_Pin		GPIO_Pin_11
	#define cSPIN_FLAG_Port		GPIOB
	
	#define cSPIN_PWM1_Pin		GPIO_Pin_0
	#define cSPIN_PWM1_Port		GPIOB
	
	#define cSPIN_PWM2_Pin		GPIO_Pin_1
	#define cSPIN_PWM2_Port		GPIOB

	#define POWER_LED_Pin		GPIO_Pin_4
	#define POWER_LED_Port		GPIOC
    
        #define STATUS_LED_Pin		GPIO_Pin_8
	#define STATUS_LED_Port		GPIOC

	#define cSPIN_STBY_RESET_Pin    GPIO_Pin_1
	#define cSPIN_STBY_RESET_Port   GPIOB
    
        #define TIM_PWM                 TIM3
	
	/* List all the peripherals, which CLKs have to be enabled! */
	#define cSPIN_PERIPHERAL_CLKs_APB1	(RCC_APB1Periph_SPI2|RCC_APB1Periph_TIM3)
	#define cSPIN_PERIPHERAL_CLKs_APB2	(RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO)
        /* Note : RCC_APB2Periph_AFIO is mandatory for interrupt enabling */
#endif

        /* cSPIN maximum number of bytes of command and arguments to set a parameter */
        #define cSPIN_CMD_ARG_MAX_NB_BYTES (4)
        /* cSPIN command + argument bytes number */
        #define cSPIN_CMD_ARG_NB_BYTES_NOP              (1)
        #define cSPIN_CMD_ARG_NB_BYTES_RUN              (4)
        #define cSPIN_CMD_ARG_NB_BYTES_STEP_CLOCK       (1)
        #define cSPIN_CMD_ARG_NB_BYTES_MOVE             (4)
        #define cSPIN_CMD_ARG_NB_BYTES_GO_TO            (4)
        #define cSPIN_CMD_ARG_NB_BYTES_GO_TO_DIR        (4)
        #define cSPIN_CMD_ARG_NB_BYTES_GO_UNTIL         (4)
        #define cSPIN_CMD_ARG_NB_BYTES_RELEASE_SW       (1)
        #define cSPIN_CMD_ARG_NB_BYTES_GO_HOME          (1)
        #define cSPIN_CMD_ARG_NB_BYTES_GO_MARK          (1)
        #define cSPIN_CMD_ARG_NB_BYTES_RESET_POS        (1)
        #define cSPIN_CMD_ARG_NB_BYTES_RESET_DEVICE     (1)
        #define cSPIN_CMD_ARG_NB_BYTES_SOFT_STOP        (1)
        #define cSPIN_CMD_ARG_NB_BYTES_HARD_STOP        (1)
        #define cSPIN_CMD_ARG_NB_BYTES_SOFT_HIZ         (1)
        #define cSPIN_CMD_ARG_NB_BYTES_HARD_HIZ         (1)
        #define cSPIN_CMD_ARG_NB_BYTES_GET_STATUS       (1)
        /* cSPIN response bytes number */
        #define cSPIN_RSP_NB_BYTES_GET_STATUS           (2)    
        /* Daisy chain command mask */
        #define DAISY_CHAIN_COMMAND_MASK (0xFA)
    
/**  cSPIN signals - Used for connection with STM32 discovery kit
  *  If another control board is used, please change the following settings
  *  according to the application board wiring diagram.
  *  Do not touch if STEVAL-PCC009V2 is used, see defs for that evalboard.
  * 
  */
#ifdef STM32_VL_Discovery
	#define cSPIN_SPI			SPI1
	
	#define cSPIN_SCK_Pin		GPIO_Pin_5
	#define cSPIN_SCK_Port		GPIOA
	
	#define cSPIN_MOSI_Pin		GPIO_Pin_7
	#define cSPIN_MOSI_Port		GPIOA
	
	#define cSPIN_MISO_Pin		GPIO_Pin_6
	#define cSPIN_MISO_Port		GPIOA
	
	#define cSPIN_nSS_Pin		GPIO_Pin_4
	#define cSPIN_nSS_Port		GPIOA
	
	#define cSPIN_BUSY_Pin		GPIO_Pin_4
	#define cSPIN_BUSY_Port		GPIOC
	
	#define cSPIN_FLAG_Pin		GPIO_Pin_5
	#define cSPIN_FLAG_Port		GPIOC
	
	#define cSPIN_PWM1_Pin		GPIO_Pin_1
	#define cSPIN_PWM1_Port		GPIOA
	
	#define cSPIN_PWM2_Pin		GPIO_Pin_0
	#define cSPIN_PWM2_Port		GPIOB
	
	/* List all the peripherals, which CLKs have to be enabled! */
	#define cSPIN_PERIPHERAL_CLKs_APB1	(0x00)
	#define cSPIN_PERIPHERAL_CLKs_APB2	(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC | RCC_APB2Periph_SPI1)
#endif

/**  cSPIN signals - Used for connection with ST_CSPIN_6480H_DISCOVERY 
  */

#ifdef ST_CSPIN_6480H_DISCOVERY
	#define cSPIN_SPI		SPI1
	
	#define cSPIN_SCK_Pin		GPIO_Pin_5
	#define cSPIN_SCK_Port		GPIOA
	
	#define cSPIN_MOSI_Pin		GPIO_Pin_7
	#define cSPIN_MOSI_Port		GPIOA
	
	#define cSPIN_MISO_Pin		GPIO_Pin_6
	#define cSPIN_MISO_Port		GPIOA
	
	#define cSPIN_nSS_Pin		GPIO_Pin_4
	#define cSPIN_nSS_Port		GPIOA
	
	#define cSPIN_BUSY_Pin		GPIO_Pin_11
	#define cSPIN_BUSY_Port		GPIOB

	#define cSPIN_FLAG_Pin		GPIO_Pin_10
	#define cSPIN_FLAG_Port		GPIOB

        /* LED_READY, GREEN*/
	#define POWER_LED_Pin		GPIO_Pin_3
	#define POWER_LED_Port		GPIOC

        /* LED_BUSY, ORANGE */
        #define LED_BUSY_Pin		GPIO_Pin_2
	#define LED_BUSY_Port		GPIOC

        /* LED_ERROR, RED */
	#define STATUS_LED_Pin		GPIO_Pin_1
	#define STATUS_LED_Port		GPIOC

        /* LED_SPARE, YELLOW */
	#define LED_SPARE_Pin		GPIO_Pin_0
	#define LED_SPARE_Port		GPIOC

	#define cSPIN_PWM1_Pin		GPIO_Pin_3
	#define cSPIN_PWM1_Port		GPIOA

	#define SW_MOTOR_Pin            GPIO_Pin_0
	#define SW_MOTOR_Port	        GPIOA

