Xcping2013/mySTM32F_MDK/STM32F_STD/INC-MB1616007_MDK/Device_drivers/myDrivers/motion/cspin/cspin1.h
	#define cSPIN_SW_Pin            GPIO_Pin_4
	#define cSPIN_SW_Port	        GPIOC

	#define BUTTON_A_Pin		GPIO_Pin_1
	#define BUTTON_A_Port		GPIOA

	#define BUTTON_B_Pin		GPIO_Pin_2
	#define BUTTON_B_Port		GPIOA
    
	#define cSPIN_STBY_RESET_Pin    GPIO_Pin_5
	#define cSPIN_STBY_RESET_Port   GPIOC
    
        #define TIM_PWM                 TIM5
   
        /* List all the peripherals, which CLKs have to be enabled! */
        /* Note : RCC_APB2Periph_AFIO is mandatory for interrupt enabling */
        #define cSPIN_PERIPHERAL_CLKs_APB1      (RCC_APB1Periph_TIM5)
	#define cSPIN_PERIPHERAL_CLKs_APB2	(RCC_APB2Periph_SPI1 | \
                                                 RCC_APB2Periph_GPIOA | \
                                                 RCC_APB2Periph_GPIOB | \
                                                 RCC_APB2Periph_GPIOC | \
                                                 RCC_APB2Periph_AFIO)
#endif

/** cSPIN parameter min and max values
  */
#define cSPIN_CONF_PARAM_STALL_TH_MV_MAX           ((uint16_t)(1000)) /* mV */

/** Register bits / masks
  */

/* cSPIN electrical position register masks */
#define cSPIN_ELPOS_STEP_MASK			((uint8_t)0xC0)
#define cSPIN_ELPOS_MICROSTEP_MASK		((uint8_t)0x3F)

/* cSPIN min speed register bit / mask */
#define cSPIN_LSPD_OPT		((uint16_t) ((0x1) << 12))
#define cSPIN_MIN_SPEED_MASK	((uint16_t)0x0FFF)

/* cSPIN full step boost bit */
#define cSPIN_BOOST_MODE        ((uint16_t) ((0x1) << 10))
#define cSPIN_FS_SPD_MASK	((uint16_t)0x03FF)

/* cSPIN Sync Output frequency enabling bit */
#define cSPIN_SYNC_EN           ((0x1) << 7)

/* cSPIN clock source monitoring enabling bit */
#define cSPIN_WD_EN     	((0x1) << 11)

#if defined(L6482)
/* cSPIN step mode bit3 must be 1 */
#define cSPIN_STEP_MODE_BIT3	((0x1) << 3)
#endif /* defined(L6482) */

/* Exported types ------------------------------------------------------------*/

typedef u8  bool;

#if defined(L6480)
/** 
  * @brief cSPIN Init structure definition
  */
typedef struct
{
  uint32_t ABS_POS;
  uint16_t EL_POS;
  uint32_t MARK;
  uint32_t SPEED;
  uint16_t ACC;
  uint16_t DEC;
  uint16_t MAX_SPEED;
  uint16_t MIN_SPEED;
  uint16_t FS_SPD;
  uint8_t  KVAL_HOLD;
  uint8_t  KVAL_RUN;
  uint8_t  KVAL_ACC;
  uint8_t  KVAL_DEC;
  uint16_t INT_SPD;
  uint8_t  ST_SLP;
  uint8_t  FN_SLP_ACC;
  uint8_t  FN_SLP_DEC;
  uint8_t  K_THERM;
  uint8_t  ADC_OUT;
  uint8_t  OCD_TH;
  uint8_t  STALL_TH;
  uint8_t  STEP_MODE;
  uint8_t  ALARM_EN;
  uint16_t GATECFG1;
  uint8_t  GATECFG2;  
  uint16_t CONFIG;
  uint16_t STATUS;
}cSPIN_RegsStruct_TypeDef;

/* cSPIN Low speed optimization */
typedef enum {
	cSPIN_LSPD_OPT_OFF		=((uint16_t)0x0000),
	cSPIN_LSPD_OPT_ON		=((uint16_t)cSPIN_LSPD_OPT)
} cSPIN_LSPD_OPT_TypeDef;

/* cSPIN Full step boost */
typedef enum {
	cSPIN_BOOST_MODE_OFF		=((uint16_t)0x0000),
	cSPIN_BOOST_MODE_ON		=((uint16_t)cSPIN_BOOST_MODE)
} cSPIN_BOOST_MODE_TypeDef;

/* cSPIN overcurrent threshold options */
typedef enum {
	cSPIN_OCD_TH_31_25mV		=((uint8_t)0x00),
	cSPIN_OCD_TH_62_5mV		=((uint8_t)0x01),
	cSPIN_OCD_TH_93_75mV		=((uint8_t)0x02),
	cSPIN_OCD_TH_125mV		=((uint8_t)0x03),
	cSPIN_OCD_TH_156_25mV		=((uint8_t)0x04),
	cSPIN_OCD_TH_187_50mV		=((uint8_t)0x05),
	cSPIN_OCD_TH_218_75mV		=((uint8_t)0x06),
	cSPIN_OCD_TH_250mV		=((uint8_t)0x07),
	cSPIN_OCD_TH_281_25mV		=((uint8_t)0x08),
	cSPIN_OCD_TH_312_5mV		=((uint8_t)0x09),
	cSPIN_OCD_TH_343_75mV		=((uint8_t)0x0A),
	cSPIN_OCD_TH_375mV		=((uint8_t)0x0B),
	cSPIN_OCD_TH_406_25mV		=((uint8_t)0x0C),
	cSPIN_OCD_TH_437_5mV		=((uint8_t)0x0D),
	cSPIN_OCD_TH_468_75mV		=((uint8_t)0x0E),
	cSPIN_OCD_TH_500mV		=((uint8_t)0x0F),
        cSPIN_OCD_TH_531_25mV		=((uint8_t)0x10),
        cSPIN_OCD_TH_562_5mV		=((uint8_t)0x11),
        cSPIN_OCD_TH_593_75mV		=((uint8_t)0x12),
        cSPIN_OCD_TH_625mV		=((uint8_t)0x13),
        cSPIN_OCD_TH_656_25mV		=((uint8_t)0x14),
        cSPIN_OCD_TH_687_5mV		=((uint8_t)0x15),
        cSPIN_OCD_TH_718_75mV		=((uint8_t)0x16),
        cSPIN_OCD_TH_750mV		=((uint8_t)0x17),
        cSPIN_OCD_TH_781_25mV		=((uint8_t)0x18),
        cSPIN_OCD_TH_812_5mV		=((uint8_t)0x19),
        cSPIN_OCD_TH_843_75mV		=((uint8_t)0x1A),
        cSPIN_OCD_TH_875mV		=((uint8_t)0x1B),
        cSPIN_OCD_TH_906_25mV		=((uint8_t)0x1C),
        cSPIN_OCD_TH_937_75mV		=((uint8_t)0x1D),
        cSPIN_OCD_TH_968_75mV		=((uint8_t)0x1E),
        cSPIN_OCD_TH_1V		        =((uint8_t)0x1F)        
} cSPIN_OCD_TH_TypeDef;

/* cSPIN STEP_MODE register masks */
typedef enum {
	cSPIN_STEP_MODE_STEP_SEL		=((uint8_t)0x07),
	cSPIN_STEP_MODE_SYNC_SEL		=((uint8_t)0x70),
	cSPIN_STEP_MODE_SYNC_EN			=((uint8_t)0x80)
} cSPIN_STEP_MODE_Masks_TypeDef;

 /* cSPIN STEP_MODE register options */
/* cSPIN STEP_SEL options */
typedef enum {
	cSPIN_STEP_SEL_1		=((uint8_t)0x00),
	cSPIN_STEP_SEL_1_2		=((uint8_t)0x01),
	cSPIN_STEP_SEL_1_4		=((uint8_t)0x02),
	cSPIN_STEP_SEL_1_8		=((uint8_t)0x03),
	cSPIN_STEP_SEL_1_16		=((uint8_t)0x04),
	cSPIN_STEP_SEL_1_32		=((uint8_t)0x05),
	cSPIN_STEP_SEL_1_64		=((uint8_t)0x06),
	cSPIN_STEP_SEL_1_128	        =((uint8_t)0x07)
} cSPIN_STEP_SEL_TypeDef;

/* cSPIN SYNC_SEL options */
typedef enum {
	cSPIN_SYNC_SEL_DISABLED		=((uint8_t)0x00),
        cSPIN_SYNC_SEL_1_2		=((uint8_t)(cSPIN_SYNC_EN|0x00)),
	cSPIN_SYNC_SEL_1		=((uint8_t)(cSPIN_SYNC_EN|0x10)),
	cSPIN_SYNC_SEL_2		=((uint8_t)(cSPIN_SYNC_EN|0x20)),
	cSPIN_SYNC_SEL_4		=((uint8_t)(cSPIN_SYNC_EN|0x30)),
	cSPIN_SYNC_SEL_8		=((uint8_t)(cSPIN_SYNC_EN|0x40)),
	cSPIN_SYNC_SEL_16		=((uint8_t)(cSPIN_SYNC_EN|0x50)),
	cSPIN_SYNC_SEL_32		=((uint8_t)(cSPIN_SYNC_EN|0x60)),
	cSPIN_SYNC_SEL_64		=((uint8_t)(cSPIN_SYNC_EN|0x70))
} cSPIN_SYNC_SEL_TypeDef;

/* cSPIN ALARM_EN register options */
typedef enum {
	cSPIN_ALARM_EN_OVERCURRENT		=((uint8_t)0x01),
	cSPIN_ALARM_EN_THERMAL_SHUTDOWN		=((uint8_t)0x02),
	cSPIN_ALARM_EN_THERMAL_WARNING		=((uint8_t)0x04),
	cSPIN_ALARM_EN_UVLO     		=((uint8_t)0x08),
	cSPIN_ALARM_EN_ADC_UVLO 		=((uint8_t)0x10),
	cSPIN_ALARM_EN_STALL_DETECTION	        =((uint8_t)0x20),
	cSPIN_ALARM_EN_SW_TURN_ON		=((uint8_t)0x40),
	cSPIN_ALARM_EN_WRONG_NPERF_CMD		=((uint8_t)0x80)
} cSPIN_ALARM_EN_TypeDef;

/* cSPIN TCC (Control current Time) options*/
typedef enum {
	cSPIN_TCC_125ns		=((uint8_t)0x00),
        cSPIN_TCC_250ns		=((uint8_t)0x01),
	cSPIN_TCC_375ns		=((uint8_t)0x02),
	cSPIN_TCC_500ns		=((uint8_t)0x03),
	cSPIN_TCC_625ns		=((uint8_t)0x04),
	cSPIN_TCC_750ns		=((uint8_t)0x05),
	cSPIN_TCC_875ns		=((uint8_t)0x06),
	cSPIN_TCC_1000ns	=((uint8_t)0x07),
	cSPIN_TCC_1125ns	=((uint8_t)0x08),
	cSPIN_TCC_1250ns	=((uint8_t)0x09),
	cSPIN_TCC_1375ns	=((uint8_t)0x0A),
	cSPIN_TCC_1500ns	=((uint8_t)0x0B),
	cSPIN_TCC_1625ns	=((uint8_t)0x0C),
	cSPIN_TCC_1750ns	=((uint8_t)0x0D),
	cSPIN_TCC_1875ns	=((uint8_t)0x0E),
	cSPIN_TCC_2000ns	=((uint8_t)0x0F),
	cSPIN_TCC_2125ns	=((uint8_t)0x10),
	cSPIN_TCC_2250ns	=((uint8_t)0x11),
	cSPIN_TCC_2375ns	=((uint8_t)0x12),
	cSPIN_TCC_2500ns	=((uint8_t)0x13),
	cSPIN_TCC_2625ns	=((uint8_t)0x14),
	cSPIN_TCC_2750ns	=((uint8_t)0x15),
	cSPIN_TCC_2875ns	=((uint8_t)0x16),
	cSPIN_TCC_3000ns	=((uint8_t)0x17),
	cSPIN_TCC_3125ns	=((uint8_t)0x18),
	cSPIN_TCC_3250ns	=((uint8_t)0x19),
	cSPIN_TCC_3375ns	=((uint8_t)0x1A),
	cSPIN_TCC_3500ns	=((uint8_t)0x1B),
	cSPIN_TCC_3625ns	=((uint8_t)0x1C),
	cSPIN_TCC_3750ns	=((uint8_t)0x1D),
        cSPIN_TCC_3750ns_bis	=((uint8_t)0x1E),
        cSPIN_TCC_3750ns_ter	=((uint8_t)0x1F)
} cSPIN_TCC_TypeDef;

/* cSPIN IGate options*/
typedef enum {
	cSPIN_IGATE_4mA		        =(((uint8_t)0x00)<<5),
        cSPIN_IGATE_4mA_Bis		=(((uint8_t)0x01)<<5),
	cSPIN_IGATE_8mA		        =(((uint8_t)0x02)<<5),
	cSPIN_IGATE_16mA		=(((uint8_t)0x03)<<5),
	cSPIN_IGATE_24mA		=(((uint8_t)0x04)<<5),
	cSPIN_IGATE_32mA		=(((uint8_t)0x05)<<5),
	cSPIN_IGATE_64mA		=(((uint8_t)0x06)<<5),
	cSPIN_IGATE_96mA		=(((uint8_t)0x07)<<5),
} cSPIN_IGATE_TypeDef;

/* cSPIN TBOOST (Turn off boost time) options*/
typedef enum {
	cSPIN_TBOOST_0ns		=(((uint8_t)0x00)<<8),
        cSPIN_TBOOST_62_5__83_3__125ns	=(((uint8_t)0x01)<<8),
	cSPIN_TBOOST_125ns		=(((uint8_t)0x02)<<8),
	cSPIN_TBOOST_250ns		=(((uint8_t)0x03)<<8),
	cSPIN_TBOOST_375ns		=(((uint8_t)0x04)<<8),
	cSPIN_TBOOST_500ns		=(((uint8_t)0x05)<<8),
	cSPIN_TBOOST_750ns		=(((uint8_t)0x06)<<8),
	cSPIN_TBOOST_1000ns		=(((uint8_t)0x07)<<8),
} cSPIN_TBOOST_TypeDef;

