Xcping2013/mySTM32F_MDK/STM32F_STD/INC-MB1616007_MDK/Device_drivers/myDrivers/motion/cspin/cspin1.h
/* cSPIN external clock watchdog */
typedef enum {
	cSPIN_WD_EN_DISABLE		=((uint16_t)0x0000),
	cSPIN_WD_EN_ENABLE		=((uint16_t)cSPIN_WD_EN)
} cSPIN_WD_EN_TypeDef;

/* cSPIN TBLANK (Blanking time) options*/
typedef enum {
	cSPIN_TBLANK_125ns		=(((uint8_t)0x00)<<5),
        cSPIN_TBLANK_250ns      	=(((uint8_t)0x01)<<5),
	cSPIN_TBLANK_375ns		=(((uint8_t)0x02)<<5),
	cSPIN_TBLANK_500ns		=(((uint8_t)0x03)<<5),
	cSPIN_TBLANK_625ns		=(((uint8_t)0x04)<<5),
	cSPIN_TBLANK_750ns		=(((uint8_t)0x05)<<5),
	cSPIN_TBLANK_875ns		=(((uint8_t)0x06)<<5),
	cSPIN_TBLANK_1000ns		=(((uint8_t)0x07)<<5),
} cSPIN_TBLANK_TypeDef;

/* cSPIN TDT (Dead time) options*/
typedef enum {
	cSPIN_TDT_125ns		=((uint8_t)0x00),
        cSPIN_TDT_250ns		=((uint8_t)0x01),
	cSPIN_TDT_375ns		=((uint8_t)0x02),
	cSPIN_TDT_500ns		=((uint8_t)0x03),
	cSPIN_TDT_625ns		=((uint8_t)0x04),
	cSPIN_TDT_750ns		=((uint8_t)0x05),
	cSPIN_TDT_875ns		=((uint8_t)0x06),
	cSPIN_TDT_1000ns	=((uint8_t)0x07),
	cSPIN_TDT_1125ns	=((uint8_t)0x08),
	cSPIN_TDT_1250ns	=((uint8_t)0x09),
	cSPIN_TDT_1375ns	=((uint8_t)0x0A),
	cSPIN_TDT_1500ns	=((uint8_t)0x0B),
	cSPIN_TDT_1625ns	=((uint8_t)0x0C),
	cSPIN_TDT_1750ns	=((uint8_t)0x0D),
	cSPIN_TDT_1875ns	=((uint8_t)0x0E),
	cSPIN_TDT_2000ns	=((uint8_t)0x0F),
	cSPIN_TDT_2125ns	=((uint8_t)0x10),
	cSPIN_TDT_2250ns	=((uint8_t)0x11),
	cSPIN_TDT_2375ns	=((uint8_t)0x12),
	cSPIN_TDT_2500ns	=((uint8_t)0x13),
	cSPIN_TDT_2625ns	=((uint8_t)0x14),
	cSPIN_TDT_2750ns	=((uint8_t)0x15),
	cSPIN_TDT_2875ns	=((uint8_t)0x16),
	cSPIN_TDT_3000ns	=((uint8_t)0x17),
	cSPIN_TDT_3125ns	=((uint8_t)0x18),
	cSPIN_TDT_3250ns	=((uint8_t)0x19),
	cSPIN_TDT_3375ns	=((uint8_t)0x1A),
	cSPIN_TDT_3500ns	=((uint8_t)0x1B),
	cSPIN_TDT_3625ns	=((uint8_t)0x1C),
	cSPIN_TDT_3750ns	=((uint8_t)0x1D),
        cSPIN_TDT_3875ns        =((uint8_t)0x1E),
        cSPIN_TDT_4000ns        =((uint8_t)0x1F)
} cSPIN_TDT_TypeDef;


/* cSPIN Config register masks */
typedef enum {
	cSPIN_CONFIG_OSC_SEL		=((uint16_t)0x0007),
	cSPIN_CONFIG_EXT_CLK		=((uint16_t)0x0008),
	cSPIN_CONFIG_SW_MODE		=((uint16_t)0x0010),
	cSPIN_CONFIG_EN_VSCOMP		=((uint16_t)0x0020),
	cSPIN_CONFIG_OC_SD		=((uint16_t)0x0080),
	cSPIN_CONFIG_UVLOVAL		=((uint16_t)0x0100),
	cSPIN_CONFIG_VCCVAL		=((uint16_t)0x0200),
	cSPIN_CONFIG_F_PWM_DEC		=((uint16_t)0x1C00),
	cSPIN_CONFIG_F_PWM_INT		=((uint16_t)0xE000)
} cSPIN_CONFIG_Masks_TypeDef;

/* cSPIN Config register options */
typedef enum {
	cSPIN_CONFIG_INT_16MHZ			=((uint16_t)0x0000),
	cSPIN_CONFIG_INT_16MHZ_OSCOUT_2MHZ	=((uint16_t)0x0008),
	cSPIN_CONFIG_INT_16MHZ_OSCOUT_4MHZ	=((uint16_t)0x0009),
	cSPIN_CONFIG_INT_16MHZ_OSCOUT_8MHZ	=((uint16_t)0x000A),
	cSPIN_CONFIG_INT_16MHZ_OSCOUT_16MHZ	=((uint16_t)0x000B),
	cSPIN_CONFIG_EXT_8MHZ_XTAL_DRIVE	=((uint16_t)0x0004),
	cSPIN_CONFIG_EXT_16MHZ_XTAL_DRIVE	=((uint16_t)0x0005),
	cSPIN_CONFIG_EXT_24MHZ_XTAL_DRIVE	=((uint16_t)0x0006),
	cSPIN_CONFIG_EXT_32MHZ_XTAL_DRIVE	=((uint16_t)0x0007),
	cSPIN_CONFIG_EXT_8MHZ_OSCOUT_INVERT	=((uint16_t)0x000C),
	cSPIN_CONFIG_EXT_16MHZ_OSCOUT_INVERT	=((uint16_t)0x000D),
	cSPIN_CONFIG_EXT_24MHZ_OSCOUT_INVERT	=((uint16_t)0x000E),
	cSPIN_CONFIG_EXT_32MHZ_OSCOUT_INVERT	=((uint16_t)0x000F)
} cSPIN_CONFIG_OSC_MGMT_TypeDef;

typedef enum {
	cSPIN_CONFIG_SW_HARD_STOP		=((uint16_t)0x0000),
	cSPIN_CONFIG_SW_USER			=((uint16_t)0x0010)
} cSPIN_CONFIG_SW_MODE_TypeDef;

typedef enum {
	cSPIN_CONFIG_VS_COMP_DISABLE	=((uint16_t)0x0000),
	cSPIN_CONFIG_VS_COMP_ENABLE	=((uint16_t)0x0020)
} cSPIN_CONFIG_EN_VSCOMP_TypeDef;

typedef enum {
	cSPIN_CONFIG_OC_SD_DISABLE		=((uint16_t)0x0000),
	cSPIN_CONFIG_OC_SD_ENABLE		=((uint16_t)0x0080)
} cSPIN_CONFIG_OC_SD_TypeDef;

typedef enum {
	cSPIN_CONFIG_UVLOVAL_LOW        =((uint16_t)0x0000),
        cSPIN_CONFIG_UVLOVAL_HIGH	=((uint16_t)0x0100),
} cSPIN_CONFIG_UVLOVAL_TypeDef;

typedef enum {
	cSPIN_CONFIG_VCCVAL_7_5V        =((uint16_t)0x0200),
	cSPIN_CONFIG_VCCVAL_15V         =((uint16_t)0x0300)
} cSPIN_CONFIG_VCCVAL_TypeDef;

typedef enum {
	cSPIN_CONFIG_PWM_DIV_1		=(((uint16_t)0x00)<<13),
	cSPIN_CONFIG_PWM_DIV_2		=(((uint16_t)0x01)<<13),
	cSPIN_CONFIG_PWM_DIV_3		=(((uint16_t)0x02)<<13),
	cSPIN_CONFIG_PWM_DIV_4		=(((uint16_t)0x03)<<13),
	cSPIN_CONFIG_PWM_DIV_5		=(((uint16_t)0x04)<<13),
	cSPIN_CONFIG_PWM_DIV_6		=(((uint16_t)0x05)<<13),
	cSPIN_CONFIG_PWM_DIV_7		=(((uint16_t)0x06)<<13)
} cSPIN_CONFIG_F_PWM_INT_TypeDef;

typedef enum {
	cSPIN_CONFIG_PWM_MUL_0_625		=(((uint16_t)0x00)<<10),
	cSPIN_CONFIG_PWM_MUL_0_75		=(((uint16_t)0x01)<<10),
	cSPIN_CONFIG_PWM_MUL_0_875		=(((uint16_t)0x02)<<10),
	cSPIN_CONFIG_PWM_MUL_1			=(((uint16_t)0x03)<<10),
	cSPIN_CONFIG_PWM_MUL_1_25		=(((uint16_t)0x04)<<10),
	cSPIN_CONFIG_PWM_MUL_1_5		=(((uint16_t)0x05)<<10),
	cSPIN_CONFIG_PWM_MUL_1_75		=(((uint16_t)0x06)<<10),
	cSPIN_CONFIG_PWM_MUL_2			=(((uint16_t)0x07)<<10)
} cSPIN_CONFIG_F_PWM_DEC_TypeDef;

/* Status Register bit masks */
typedef enum {
	cSPIN_STATUS_HIZ		=(((uint16_t)0x0001)),
	cSPIN_STATUS_BUSY		=(((uint16_t)0x0002)),
	cSPIN_STATUS_SW_F		=(((uint16_t)0x0004)),
	cSPIN_STATUS_SW_EVN		=(((uint16_t)0x0008)),
	cSPIN_STATUS_DIR		=(((uint16_t)0x0010)),
	cSPIN_STATUS_MOT_STATUS		=(((uint16_t)0x0060)),
	cSPIN_STATUS_NOTPERF_CMD	=(((uint16_t)0x0080)),
	cSPIN_STATUS_STCK_MOD		=(((uint16_t)0x0100)),
	cSPIN_STATUS_UVLO		=(((uint16_t)0x0200)),
	cSPIN_STATUS_UVLO_ADC	        =(((uint16_t)0x0400)),
	cSPIN_STATUS_TH_SD		=(((uint16_t)0x1800)),
	cSPIN_STATUS_OCD		=(((uint16_t)0x2000)),
	cSPIN_STATUS_STEP_LOSS_A	=(((uint16_t)0x4000)),
	cSPIN_STATUS_STEP_LOSS_B	=(((uint16_t)0x8000))
} cSPIN_STATUS_Masks_TypeDef;

/* Status Register options */
typedef enum {
	cSPIN_STATUS_MOT_STATUS_STOPPED		=(((uint16_t)0x0000)<<5),
	cSPIN_STATUS_MOT_STATUS_ACCELERATION	=(((uint16_t)0x0001)<<5),
	cSPIN_STATUS_MOT_STATUS_DECELERATION	=(((uint16_t)0x0002)<<5),
	cSPIN_STATUS_MOT_STATUS_CONST_SPD	=(((uint16_t)0x0003)<<5)
} cSPIN_STATUS_TypeDef;

/* cSPIN internal register addresses */
typedef enum {
	cSPIN_ABS_POS			=((uint8_t)0x01),
	cSPIN_EL_POS			=((uint8_t)0x02),
	cSPIN_MARK			=((uint8_t)0x03),	
	cSPIN_SPEED			=((uint8_t)0x04),
	cSPIN_ACC			=((uint8_t)0x05),
	cSPIN_DEC			=((uint8_t)0x06),
	cSPIN_MAX_SPEED			=((uint8_t)0x07),
	cSPIN_MIN_SPEED			=((uint8_t)0x08),
	cSPIN_FS_SPD			=((uint8_t)0x15),
	cSPIN_KVAL_HOLD			=((uint8_t)0x09),
	cSPIN_KVAL_RUN			=((uint8_t)0x0A),
	cSPIN_KVAL_ACC			=((uint8_t)0x0B),
	cSPIN_KVAL_DEC			=((uint8_t)0x0C),
	cSPIN_INT_SPD			=((uint8_t)0x0D),
	cSPIN_ST_SLP			=((uint8_t)0x0E),
	cSPIN_FN_SLP_ACC		=((uint8_t)0x0F),
	cSPIN_FN_SLP_DEC		=((uint8_t)0x10),
	cSPIN_K_THERM			=((uint8_t)0x11),
	cSPIN_ADC_OUT			=((uint8_t)0x12),
	cSPIN_OCD_TH			=((uint8_t)0x13),
	cSPIN_STALL_TH			=((uint8_t)0x14),
	cSPIN_STEP_MODE			=((uint8_t)0x16),
	cSPIN_ALARM_EN			=((uint8_t)0x17),
	cSPIN_GATECFG1			=((uint8_t)0x18),
	cSPIN_GATECFG2			=((uint8_t)0x19),
	cSPIN_CONFIG			=((uint8_t)0x1A),
	cSPIN_STATUS			=((uint8_t)0x1B)
} cSPIN_Registers_TypeDef;

