Xcping2013/mySTM32F_MDK/STM32F_STD/INC-MB1616007_MDK/Device_drivers/myDrivers/motion/cspin/cspin1.h
/* cSPIN command set */
typedef enum {
	cSPIN_NOP		=((uint8_t)0x00),
	cSPIN_SET_PARAM		=((uint8_t)0x00),
	cSPIN_GET_PARAM		=((uint8_t)0x20),
	cSPIN_RUN		=((uint8_t)0x50),
	cSPIN_STEP_CLOCK	=((uint8_t)0x58),
	cSPIN_MOVE		=((uint8_t)0x40),
	cSPIN_GO_TO		=((uint8_t)0x60),
	cSPIN_GO_TO_DIR		=((uint8_t)0x68),
	cSPIN_GO_UNTIL		=((uint8_t)0x82),
        cSPIN_GO_UNTIL_ACT_CPY  =((uint8_t)0x8A),
	cSPIN_RELEASE_SW	=((uint8_t)0x92),
	cSPIN_GO_HOME		=((uint8_t)0x70),
	cSPIN_GO_MARK		=((uint8_t)0x78),
	cSPIN_RESET_POS		=((uint8_t)0xD8),
	cSPIN_RESET_DEVICE	=((uint8_t)0xC0),
	cSPIN_SOFT_STOP		=((uint8_t)0xB0),
	cSPIN_HARD_STOP		=((uint8_t)0xB8),
	cSPIN_SOFT_HIZ		=((uint8_t)0xA0),
	cSPIN_HARD_HIZ		=((uint8_t)0xA8),
	cSPIN_GET_STATUS	=((uint8_t)0xD0),
	cSPIN_RESERVED_CMD1	=((uint8_t)0xEB),
	cSPIN_RESERVED_CMD2	=((uint8_t)0xF8)
} cSPIN_Commands_TypeDef;

/* cSPIN direction options */
typedef enum {
	FWD		=((uint8_t)0x01),
	REV		=((uint8_t)0x00)
} cSPIN_Direction_TypeDef;

/* cSPIN action options */
typedef enum {
	ACTION_RESET	=((uint8_t)0x00),
	ACTION_COPY	=((uint8_t)0x08)
} cSPIN_Action_TypeDef;
/**
  * @}
  */
#endif /* defined(L6480) */

#if defined(L6482)
/** 
  * @brief cSPIN Init structure definition
  */
typedef struct
{
  uint32_t ABS_POS;
  uint16_t EL_POS;
  uint32_t MARK;
  uint32_t SPEED;
  uint16_t ACC;
  uint16_t DEC;
  uint16_t MAX_SPEED;
  uint16_t MIN_SPEED;
  uint16_t FS_SPD;
  uint8_t  TVAL_HOLD;
  uint8_t  TVAL_RUN;
  uint8_t  TVAL_ACC;
  uint8_t  TVAL_DEC;
  uint16_t RESERVED_3;
  uint8_t  T_FAST;
  uint8_t  TON_MIN;
  uint8_t  TOFF_MIN;
  uint8_t  RESERVED_2;
  uint8_t  ADC_OUT;
  uint8_t  OCD_TH;
  uint8_t  RESERVED_1;
  uint8_t  STEP_MODE;
  uint8_t  ALARM_EN;
  uint16_t GATECFG1;
  uint8_t  GATECFG2;
  uint16_t CONFIG;
  uint16_t STATUS;
}cSPIN_RegsStruct_TypeDef;

/* cSPIN maximum fall step times */
typedef enum {
	cSPIN_FAST_STEP_2us		=((uint8_t)0x00),
	cSPIN_FAST_STEP_4us		=((uint8_t)0x01),
	cSPIN_FAST_STEP_6us		=((uint8_t)0x02),
	cSPIN_FAST_STEP_8us		=((uint8_t)0x03),
	cSPIN_FAST_STEP_10us		=((uint8_t)0x04),
	cSPIN_FAST_STEP_12us		=((uint8_t)0x05),
	cSPIN_FAST_STEP_14us		=((uint8_t)0x06),
	cSPIN_FAST_STEP_16us		=((uint8_t)0x07),
	cSPIN_FAST_STEP_18us		=((uint8_t)0x08),
	cSPIN_FAST_STEP_20us		=((uint8_t)0x09),
	cSPIN_FAST_STEP_22us		=((uint8_t)0x0A),
	cSPIN_FAST_STEP_24s		=((uint8_t)0x0B),
	cSPIN_FAST_STEP_26us		=((uint8_t)0x0C),
	cSPIN_FAST_STEP_28us		=((uint8_t)0x0D),
	cSPIN_FAST_STEP_30us		=((uint8_t)0x0E),
	cSPIN_FAST_STEP_32us		=((uint8_t)0x0F)
} cSPIN_FAST_STEP_TypeDef;

/* cSPIN maximum fast decay times */
typedef enum {
	cSPIN_TOFF_FAST_2us		=(((uint8_t)0x00)<<4),
	cSPIN_TOFF_FAST_4us		=(((uint8_t)0x01)<<4),
	cSPIN_TOFF_FAST_6us		=(((uint8_t)0x02)<<4),
	cSPIN_TOFF_FAST_8us		=(((uint8_t)0x03)<<4),
	cSPIN_TOFF_FAST_10us		=(((uint8_t)0x04)<<4),
	cSPIN_TOFF_FAST_12us		=(((uint8_t)0x05)<<4),
	cSPIN_TOFF_FAST_14us		=(((uint8_t)0x06)<<4),
	cSPIN_TOFF_FAST_16us		=(((uint8_t)0x07)<<4),
	cSPIN_TOFF_FAST_18us		=(((uint8_t)0x08)<<4),
	cSPIN_TOFF_FAST_20us		=(((uint8_t)0x09)<<4),
	cSPIN_TOFF_FAST_22us		=(((uint8_t)0x0A)<<4),
	cSPIN_TOFF_FAST_24us		=(((uint8_t)0x0B)<<4),
	cSPIN_TOFF_FAST_26us		=(((uint8_t)0x0C)<<4),
	cSPIN_TOFF_FAST_28us		=(((uint8_t)0x0D)<<4),
	cSPIN_TOFF_FAST_30us		=(((uint8_t)0x0E)<<4),
	cSPIN_TOFF_FAST_32us		=(((uint8_t)0x0F)<<4)
} cSPIN_TOFF_FAST_TypeDef;

/* cSPIN overcurrent threshold options */
typedef enum {
	cSPIN_OCD_TH_31_25mV		=((uint8_t)0x00),
	cSPIN_OCD_TH_62_5mV		=((uint8_t)0x01),
	cSPIN_OCD_TH_93_75mV		=((uint8_t)0x02),
	cSPIN_OCD_TH_125mV		=((uint8_t)0x03),
	cSPIN_OCD_TH_156_25mV		=((uint8_t)0x04),
	cSPIN_OCD_TH_187_50mV		=((uint8_t)0x05),
	cSPIN_OCD_TH_218_75mV		=((uint8_t)0x06),
	cSPIN_OCD_TH_250mV		=((uint8_t)0x07),
	cSPIN_OCD_TH_281_25mV		=((uint8_t)0x08),
	cSPIN_OCD_TH_312_5mV		=((uint8_t)0x09),
	cSPIN_OCD_TH_343_75mV		=((uint8_t)0x0A),
	cSPIN_OCD_TH_375mV		=((uint8_t)0x0B),
	cSPIN_OCD_TH_406_25mV		=((uint8_t)0x0C),
	cSPIN_OCD_TH_437_5mV		=((uint8_t)0x0D),
	cSPIN_OCD_TH_468_75mV		=((uint8_t)0x0E),
	cSPIN_OCD_TH_500mV		=((uint8_t)0x0F),
        cSPIN_OCD_TH_531_25mV		=((uint8_t)0x10),
        cSPIN_OCD_TH_562_5mV		=((uint8_t)0x11),
        cSPIN_OCD_TH_593_75mV		=((uint8_t)0x12),
        cSPIN_OCD_TH_625mV		=((uint8_t)0x13),
        cSPIN_OCD_TH_656_25mV		=((uint8_t)0x14),
        cSPIN_OCD_TH_687_5mV		=((uint8_t)0x15),
        cSPIN_OCD_TH_718_75mV		=((uint8_t)0x16),
        cSPIN_OCD_TH_750mV		=((uint8_t)0x17),
        cSPIN_OCD_TH_781_25mV		=((uint8_t)0x18),
        cSPIN_OCD_TH_812_5mV		=((uint8_t)0x19),
        cSPIN_OCD_TH_843_75mV		=((uint8_t)0x1A),
        cSPIN_OCD_TH_875mV		=((uint8_t)0x1B),
        cSPIN_OCD_TH_906_25mV		=((uint8_t)0x1C),
        cSPIN_OCD_TH_937_75mV		=((uint8_t)0x1D),
        cSPIN_OCD_TH_968_75mV		=((uint8_t)0x1E),
        cSPIN_OCD_TH_1V		        =((uint8_t)0x1F)        
} cSPIN_OCD_TH_TypeDef;

/* cSPIN STEP_MODE register masks */
typedef enum {
	cSPIN_STEP_MODE_STEP_SEL		=((uint8_t)0x07),
	cSPIN_STEP_MODE_SYNC_SEL		=((uint8_t)0x70),
	cSPIN_STEP_MODE_SYNC_EN			=((uint8_t)0x80)
} cSPIN_STEP_MODE_Masks_TypeDef;

/* cSPIN STEP_MODE register options */
/* cSPIN STEP_SEL options */
typedef enum {
	cSPIN_STEP_SEL_1		=((uint8_t)(cSPIN_STEP_MODE_BIT3|0x00)),
	cSPIN_STEP_SEL_1_2		=((uint8_t)(cSPIN_STEP_MODE_BIT3|0x01)),
	cSPIN_STEP_SEL_1_4		=((uint8_t)(cSPIN_STEP_MODE_BIT3|0x02)),
	cSPIN_STEP_SEL_1_8		=((uint8_t)(cSPIN_STEP_MODE_BIT3|0x03)),
	cSPIN_STEP_SEL_1_16		=((uint8_t)(cSPIN_STEP_MODE_BIT3|0x04))
} cSPIN_STEP_SEL_TypeDef;

/* cSPIN SYNC_SEL options */
typedef enum {
	cSPIN_SYNC_SEL_DISABLED		=((uint8_t)0x00),
        cSPIN_SYNC_SEL_1_2		=((uint8_t)(cSPIN_SYNC_EN|0x00)),
	cSPIN_SYNC_SEL_1		=((uint8_t)(cSPIN_SYNC_EN|0x10)),
	cSPIN_SYNC_SEL_2		=((uint8_t)(cSPIN_SYNC_EN|0x20)),
	cSPIN_SYNC_SEL_4		=((uint8_t)(cSPIN_SYNC_EN|0x30)),
	cSPIN_SYNC_SEL_8		=((uint8_t)(cSPIN_SYNC_EN|0x40))
} cSPIN_SYNC_SEL_TypeDef;

/* cSPIN ALARM_EN register options */
typedef enum {
	cSPIN_ALARM_EN_OVERCURRENT		=((uint8_t)0x01),
	cSPIN_ALARM_EN_THERMAL_SHUTDOWN		=((uint8_t)0x02),
	cSPIN_ALARM_EN_THERMAL_WARNING		=((uint8_t)0x04),
	cSPIN_ALARM_EN_UVLO     		=((uint8_t)0x08),
	cSPIN_ALARM_EN_ADC_UVLO 		=((uint8_t)0x10),
	cSPIN_ALARM_EN_SW_TURN_ON		=((uint8_t)0x40),
	cSPIN_ALARM_EN_WRONG_NPERF_CMD		=((uint8_t)0x80)
} cSPIN_ALARM_EN_TypeDef;

/* cSPIN TCC (Control current Time) options*/
typedef enum {
	cSPIN_TCC_125ns		=((uint8_t)0x00),
        cSPIN_TCC_250ns		=((uint8_t)0x01),
	cSPIN_TCC_375ns		=((uint8_t)0x02),
	cSPIN_TCC_500ns		=((uint8_t)0x03),
	cSPIN_TCC_625ns		=((uint8_t)0x04),
	cSPIN_TCC_750ns		=((uint8_t)0x05),
	cSPIN_TCC_875ns		=((uint8_t)0x06),
	cSPIN_TCC_1000ns	=((uint8_t)0x07),
	cSPIN_TCC_1125ns	=((uint8_t)0x08),
	cSPIN_TCC_1250ns	=((uint8_t)0x09),
	cSPIN_TCC_1375ns	=((uint8_t)0x0A),
	cSPIN_TCC_1500ns	=((uint8_t)0x0B),
	cSPIN_TCC_1625ns	=((uint8_t)0x0C),
	cSPIN_TCC_1750ns	=((uint8_t)0x0D),
	cSPIN_TCC_1875ns	=((uint8_t)0x0E),
	cSPIN_TCC_2000ns	=((uint8_t)0x0F),
	cSPIN_TCC_2125ns	=((uint8_t)0x10),
	cSPIN_TCC_2250ns	=((uint8_t)0x11),
	cSPIN_TCC_2375ns	=((uint8_t)0x12),
	cSPIN_TCC_2500ns	=((uint8_t)0x13),
	cSPIN_TCC_2625ns	=((uint8_t)0x14),
	cSPIN_TCC_2750ns	=((uint8_t)0x15),
	cSPIN_TCC_2875ns	=((uint8_t)0x16),
	cSPIN_TCC_3000ns	=((uint8_t)0x17),
	cSPIN_TCC_3125ns	=((uint8_t)0x18),
	cSPIN_TCC_3250ns	=((uint8_t)0x19),
	cSPIN_TCC_3375ns	=((uint8_t)0x1A),
	cSPIN_TCC_3500ns	=((uint8_t)0x1B),
	cSPIN_TCC_3625ns	=((uint8_t)0x1C),
	cSPIN_TCC_3750ns	=((uint8_t)0x1D),
        cSPIN_TCC_3750ns_bis	=((uint8_t)0x1E),
        cSPIN_TCC_3750ns_ter	=((uint8_t)0x1F)
} cSPIN_TCC_TypeDef;

/* cSPIN IGate options*/
typedef enum {
	cSPIN_IGATE_4mA		        =(((uint8_t)0x00)<<5),
        cSPIN_IGATE_4mA_Bis		=(((uint8_t)0x01)<<5),
	cSPIN_IGATE_8mA		        =(((uint8_t)0x02)<<5),
	cSPIN_IGATE_16mA		=(((uint8_t)0x03)<<5),
	cSPIN_IGATE_24mA		=(((uint8_t)0x04)<<5),
	cSPIN_IGATE_32mA		=(((uint8_t)0x05)<<5),
	cSPIN_IGATE_64mA		=(((uint8_t)0x06)<<5),
	cSPIN_IGATE_96mA		=(((uint8_t)0x07)<<5),
} cSPIN_IGATE_TypeDef;

/* cSPIN TBOOST (Turn off boost time) options*/
typedef enum {
	cSPIN_TBOOST_0ns		=(((uint8_t)0x00)<<8),
        cSPIN_TBOOST_62_5__83_3__125ns	=(((uint8_t)0x01)<<8),
	cSPIN_TBOOST_125ns		=(((uint8_t)0x02)<<8),
	cSPIN_TBOOST_250ns		=(((uint8_t)0x03)<<8),
	cSPIN_TBOOST_375ns		=(((uint8_t)0x04)<<8),
	cSPIN_TBOOST_500ns		=(((uint8_t)0x05)<<8),
	cSPIN_TBOOST_750ns		=(((uint8_t)0x06)<<8),
	cSPIN_TBOOST_1000ns		=(((uint8_t)0x07)<<8),
} cSPIN_TBOOST_TypeDef;

