Xcping2013/mySTM32F_MDK/STM32F_STD/INC-MB1616007_MDK/Device_drivers/myDrivers/motion/cspin/cspin1.h
/* cSPIN external clock watchdog */
typedef enum {
	cSPIN_WD_EN_DISABLE		=((uint16_t)0x0000),
	cSPIN_WD_EN_ENABLE		=((uint16_t)cSPIN_WD_EN)
} cSPIN_WD_EN_TypeDef;

/* cSPIN TBLANK (Blanking time) options*/
typedef enum {
	cSPIN_TBLANK_125ns		=(((uint8_t)0x00)<<5),
        cSPIN_TBLANK_250ns      	=(((uint8_t)0x01)<<5),
	cSPIN_TBLANK_375ns		=(((uint8_t)0x02)<<5),
	cSPIN_TBLANK_500ns		=(((uint8_t)0x03)<<5),
	cSPIN_TBLANK_625ns		=(((uint8_t)0x04)<<5),
	cSPIN_TBLANK_750ns		=(((uint8_t)0x05)<<5),
	cSPIN_TBLANK_875ns		=(((uint8_t)0x06)<<5),
	cSPIN_TBLANK_1000ns		=(((uint8_t)0x07)<<5),
} cSPIN_TBLANK_TypeDef;

/* cSPIN TDT (Dead time) options*/
typedef enum {
	cSPIN_TDT_125ns		=((uint8_t)0x00),
        cSPIN_TDT_250ns		=((uint8_t)0x01),
	cSPIN_TDT_375ns		=((uint8_t)0x02),
	cSPIN_TDT_500ns		=((uint8_t)0x03),
	cSPIN_TDT_625ns		=((uint8_t)0x04),
	cSPIN_TDT_750ns		=((uint8_t)0x05),
	cSPIN_TDT_875ns		=((uint8_t)0x06),
	cSPIN_TDT_1000ns	=((uint8_t)0x07),
	cSPIN_TDT_1125ns	=((uint8_t)0x08),
	cSPIN_TDT_1250ns	=((uint8_t)0x09),
	cSPIN_TDT_1375ns	=((uint8_t)0x0A),
	cSPIN_TDT_1500ns	=((uint8_t)0x0B),
	cSPIN_TDT_1625ns	=((uint8_t)0x0C),
	cSPIN_TDT_1750ns	=((uint8_t)0x0D),
	cSPIN_TDT_1875ns	=((uint8_t)0x0E),
	cSPIN_TDT_2000ns	=((uint8_t)0x0F),
	cSPIN_TDT_2125ns	=((uint8_t)0x10),
	cSPIN_TDT_2250ns	=((uint8_t)0x11),
	cSPIN_TDT_2375ns	=((uint8_t)0x12),
	cSPIN_TDT_2500ns	=((uint8_t)0x13),
	cSPIN_TDT_2625ns	=((uint8_t)0x14),
	cSPIN_TDT_2750ns	=((uint8_t)0x15),
	cSPIN_TDT_2875ns	=((uint8_t)0x16),
	cSPIN_TDT_3000ns	=((uint8_t)0x17),
	cSPIN_TDT_3125ns	=((uint8_t)0x18),
	cSPIN_TDT_3250ns	=((uint8_t)0x19),
	cSPIN_TDT_3375ns	=((uint8_t)0x1A),
	cSPIN_TDT_3500ns	=((uint8_t)0x1B),
	cSPIN_TDT_3625ns	=((uint8_t)0x1C),
	cSPIN_TDT_3750ns	=((uint8_t)0x1D),
        cSPIN_TDT_3875ns        =((uint8_t)0x1E),
        cSPIN_TDT_4000ns        =((uint8_t)0x1F)
} cSPIN_TDT_TypeDef;

/* cSPIN Config register masks */
typedef enum {
	cSPIN_CONFIG_OSC_SEL					=((uint16_t)0x0007),
	cSPIN_CONFIG_EXT_CLK					=((uint16_t)0x0008),
	cSPIN_CONFIG_SW_MODE					=((uint16_t)0x0010),
	cSPIN_CONFIG_EN_VSCOMP					=((uint16_t)0x0020),
	cSPIN_CONFIG_OC_SD					=((uint16_t)0x0080),
	cSPIN_CONFIG_POW_SR					=((uint16_t)0x0300),
	cSPIN_CONFIG_TSW					=((uint16_t)0x7C00),
	cSPIN_CONFIG_PRED_EN					=((uint16_t)0x8000)
} cSPIN_CONFIG_Masks_TypeDef;

/* cSPIN Config register options */
typedef enum {
	cSPIN_CONFIG_INT_16MHZ				=((uint16_t)0x0000),
	cSPIN_CONFIG_INT_16MHZ_OSCOUT_2MHZ		=((uint16_t)0x0008),
	cSPIN_CONFIG_INT_16MHZ_OSCOUT_4MHZ		=((uint16_t)0x0009),
	cSPIN_CONFIG_INT_16MHZ_OSCOUT_8MHZ		=((uint16_t)0x000A),
	cSPIN_CONFIG_INT_16MHZ_OSCOUT_16MHZ		=((uint16_t)0x000B),
	cSPIN_CONFIG_EXT_8MHZ_XTAL_DRIVE		=((uint16_t)0x0004),
	cSPIN_CONFIG_EXT_16MHZ_XTAL_DRIVE		=((uint16_t)0x0005),
	cSPIN_CONFIG_EXT_24MHZ_XTAL_DRIVE		=((uint16_t)0x0006),
	cSPIN_CONFIG_EXT_32MHZ_XTAL_DRIVE		=((uint16_t)0x0007),
	cSPIN_CONFIG_EXT_8MHZ_OSCOUT_INVERT		=((uint16_t)0x000C),
	cSPIN_CONFIG_EXT_16MHZ_OSCOUT_INVERT	        =((uint16_t)0x000D),
	cSPIN_CONFIG_EXT_24MHZ_OSCOUT_INVERT	        =((uint16_t)0x000E),
	cSPIN_CONFIG_EXT_32MHZ_OSCOUT_INVERT	        =((uint16_t)0x000F)
} cSPIN_CONFIG_OSC_MGMT_TypeDef;

typedef enum {
	cSPIN_CONFIG_SW_HARD_STOP		=((uint16_t)0x0000),
	cSPIN_CONFIG_SW_USER			=((uint16_t)0x0010)
} cSPIN_CONFIG_SW_MODE_TypeDef;

typedef enum {
	cSPIN_CONFIG_TQ_REG_TVAL_USED	        =((uint16_t)0x0000),
	cSPIN_CONFIG_TQ_REG_ADC_OUT		=((uint16_t)0x0020)
} cSPIN_CONFIG_EN_TQREG_TypeDef;

typedef enum {
	cSPIN_CONFIG_OC_SD_DISABLE		=((uint16_t)0x0000),
	cSPIN_CONFIG_OC_SD_ENABLE		=((uint16_t)0x0080)
} cSPIN_CONFIG_OC_SD_TypeDef;

typedef enum {
	cSPIN_CONFIG_UVLOVAL_LOW        =((uint16_t)0x0000),
        cSPIN_CONFIG_UVLOVAL_HIGH	=((uint16_t)0x0100),
} cSPIN_CONFIG_UVLOVAL_TypeDef;

typedef enum {
	cSPIN_CONFIG_VCCVAL_7_5V        =((uint16_t)0x0200),
	cSPIN_CONFIG_VCCVAL_15V         =((uint16_t)0x0300)
} cSPIN_CONFIG_VCCVAL_TypeDef;

typedef enum {
	cSPIN_CONFIG_TSW_004us		=(((uint16_t)0x01)<<10),
	cSPIN_CONFIG_TSW_008us		=(((uint16_t)0x02)<<10),
	cSPIN_CONFIG_TSW_012us		=(((uint16_t)0x03)<<10),
	cSPIN_CONFIG_TSW_016us		=(((uint16_t)0x04)<<10),
	cSPIN_CONFIG_TSW_020us		=(((uint16_t)0x05)<<10),
	cSPIN_CONFIG_TSW_024us		=(((uint16_t)0x06)<<10),
	cSPIN_CONFIG_TSW_028us		=(((uint16_t)0x07)<<10),
	cSPIN_CONFIG_TSW_032us		=(((uint16_t)0x08)<<10),
	cSPIN_CONFIG_TSW_036us		=(((uint16_t)0x09)<<10),
	cSPIN_CONFIG_TSW_040us		=(((uint16_t)0x0A)<<10),
	cSPIN_CONFIG_TSW_044us		=(((uint16_t)0x0B)<<10),
	cSPIN_CONFIG_TSW_048us		=(((uint16_t)0x0C)<<10),
	cSPIN_CONFIG_TSW_052us		=(((uint16_t)0x0D)<<10),
	cSPIN_CONFIG_TSW_056us		=(((uint16_t)0x0E)<<10),
	cSPIN_CONFIG_TSW_060us		=(((uint16_t)0x0F)<<10),
	cSPIN_CONFIG_TSW_064us		=(((uint16_t)0x10)<<10),
	cSPIN_CONFIG_TSW_068us		=(((uint16_t)0x11)<<10),
	cSPIN_CONFIG_TSW_072us		=(((uint16_t)0x12)<<10),
	cSPIN_CONFIG_TSW_076us		=(((uint16_t)0x13)<<10),
	cSPIN_CONFIG_TSW_080us		=(((uint16_t)0x14)<<10),
	cSPIN_CONFIG_TSW_084us		=(((uint16_t)0x15)<<10),
	cSPIN_CONFIG_TSW_088us		=(((uint16_t)0x16)<<10),
	cSPIN_CONFIG_TSW_092us		=(((uint16_t)0x17)<<10),
	cSPIN_CONFIG_TSW_096us		=(((uint16_t)0x18)<<10),
	cSPIN_CONFIG_TSW_100us		=(((uint16_t)0x19)<<10),
	cSPIN_CONFIG_TSW_104us		=(((uint16_t)0x1A)<<10),
	cSPIN_CONFIG_TSW_108us		=(((uint16_t)0x1B)<<10),
	cSPIN_CONFIG_TSW_112us		=(((uint16_t)0x1C)<<10),
	cSPIN_CONFIG_TSW_116us		=(((uint16_t)0x1D)<<10),
	cSPIN_CONFIG_TSW_120us		=(((uint16_t)0x1E)<<10),
        cSPIN_CONFIG_TSW_124us		=(((uint16_t)0x1F)<<10)        
} cSPIN_CONFIG_TSW_TypeDef;

typedef enum {
	cSPIN_CONFIG_PRED_DISABLE	=((uint16_t)0x0000),
	cSPIN_CONFIG_PRED_ENABLE	=((uint16_t)0x8000)
} cSPIN_CONFIG_PRED_EN_TypeDef;

/* Status Register bit masks */
typedef enum {
	cSPIN_STATUS_HIZ		=(((uint16_t)0x0001)),
	cSPIN_STATUS_BUSY		=(((uint16_t)0x0002)),
	cSPIN_STATUS_SW_F		=(((uint16_t)0x0004)),
	cSPIN_STATUS_SW_EVN		=(((uint16_t)0x0008)),
	cSPIN_STATUS_DIR		=(((uint16_t)0x0010)),
	cSPIN_STATUS_MOT_STATUS		=(((uint16_t)0x0060)),
	cSPIN_STATUS_NOTPERF_CMD	=(((uint16_t)0x0080)),
	cSPIN_STATUS_STCK_MOD		=(((uint16_t)0x0100)),
	cSPIN_STATUS_UVLO		=(((uint16_t)0x0200)),
	cSPIN_STATUS_UVLO_ADC           =(((uint16_t)0x0400)),
	cSPIN_STATUS_TH_SD		=(((uint16_t)0x1800)),
	cSPIN_STATUS_OCD		=(((uint16_t)0x2000))
} cSPIN_STATUS_Masks_TypeDef;

