Xcping2013/mySTM32F_MDK/STM32F_STD/INC-MB1616007_MDK/Device_drivers/myDrivers/motion/cspin/cspin1.h
/* Status Register options */
typedef enum {
	cSPIN_STATUS_MOT_STATUS_STOPPED		=(((uint16_t)0x0000)<<5),
	cSPIN_STATUS_MOT_STATUS_ACCELERATION	=(((uint16_t)0x0001)<<5),
	cSPIN_STATUS_MOT_STATUS_DECELERATION	=(((uint16_t)0x0002)<<5),
	cSPIN_STATUS_MOT_STATUS_CONST_SPD	=(((uint16_t)0x0003)<<5)
} cSPIN_STATUS_TypeDef;

/* cSPIN internal register addresses */
typedef enum {
	cSPIN_ABS_POS			=((uint8_t)0x01),
	cSPIN_EL_POS			=((uint8_t)0x02),
	cSPIN_MARK			=((uint8_t)0x03),
	cSPIN_SPEED			=((uint8_t)0x04),
	cSPIN_ACC			=((uint8_t)0x05),
	cSPIN_DEC			=((uint8_t)0x06),
	cSPIN_MAX_SPEED			=((uint8_t)0x07),
	cSPIN_MIN_SPEED			=((uint8_t)0x08),
	cSPIN_FS_SPD			=((uint8_t)0x15),
	cSPIN_TVAL_HOLD			=((uint8_t)0x09),
	cSPIN_TVAL_RUN			=((uint8_t)0x0A),
	cSPIN_TVAL_ACC			=((uint8_t)0x0B),
	cSPIN_TVAL_DEC			=((uint8_t)0x0C),
	cSPIN_RESERVED_REG3		=((uint8_t)0x0D),
	cSPIN_T_FAST			=((uint8_t)0x0E),
	cSPIN_TON_MIN		        =((uint8_t)0x0F),
	cSPIN_TOFF_MIN		        =((uint8_t)0x10),
	cSPIN_RESERVED_REG2		=((uint8_t)0x11),
	cSPIN_ADC_OUT			=((uint8_t)0x12),
	cSPIN_OCD_TH			=((uint8_t)0x13),
	cSPIN_RESERVED_REG1		=((uint8_t)0x14),
	cSPIN_STEP_MODE			=((uint8_t)0x16),
	cSPIN_ALARM_EN			=((uint8_t)0x17),
	cSPIN_GATECFG1			=((uint8_t)0x18),
	cSPIN_GATECFG2			=((uint8_t)0x19),
	cSPIN_CONFIG		        =((uint8_t)0x1A),
	cSPIN_STATUS		        =((uint8_t)0x1B)
} cSPIN_Registers_TypeDef;

/* cSPIN command set */
typedef enum {
	cSPIN_NOP		=((uint8_t)0x00),
	cSPIN_SET_PARAM		=((uint8_t)0x00),
	cSPIN_GET_PARAM		=((uint8_t)0x20),
	cSPIN_RUN		=((uint8_t)0x50),
	cSPIN_STEP_CLOCK	=((uint8_t)0x58),
	cSPIN_MOVE		=((uint8_t)0x40),
	cSPIN_GO_TO		=((uint8_t)0x60),
	cSPIN_GO_TO_DIR		=((uint8_t)0x68),
	cSPIN_GO_UNTIL		=((uint8_t)0x82),
        cSPIN_GO_UNTIL_ACT_CPY  =((uint8_t)0x8A),
	cSPIN_RELEASE_SW	=((uint8_t)0x92),
	cSPIN_GO_HOME		=((uint8_t)0x70),
	cSPIN_GO_MARK		=((uint8_t)0x78),
	cSPIN_RESET_POS		=((uint8_t)0xD8),
	cSPIN_RESET_DEVICE	=((uint8_t)0xC0),
	cSPIN_SOFT_STOP		=((uint8_t)0xB0),
	cSPIN_HARD_STOP		=((uint8_t)0xB8),
	cSPIN_SOFT_HIZ		=((uint8_t)0xA0),
	cSPIN_HARD_HIZ		=((uint8_t)0xA8),
	cSPIN_GET_STATUS	=((uint8_t)0xD0),
	cSPIN_RESERVED_CMD2	=((uint8_t)0xEB),
	cSPIN_RESERVED_CMD1	=((uint8_t)0xF8)
} cSPIN_Commands_TypeDef;

/* cSPIN direction options */
typedef enum {
	FWD		=((uint8_t)0x01),
	REV		=((uint8_t)0x00)
} cSPIN_Direction_TypeDef;

/* cSPIN action options */
typedef enum {
	ACTION_RESET	=((uint8_t)0x00),
	ACTION_COPY	=((uint8_t)0x08)
} cSPIN_Action_TypeDef;
/**
  * @}
  */
#endif /* defined(L6482) */

/* Exported macro ------------------------------------------------------------*/
#define Speed_Steps_to_Par(steps) ((uint32_t)(((steps)*67.108864)+0.5))			/* Speed conversion, range 0 to 15625 steps/s */
#define AccDec_Steps_to_Par(steps) ((uint16_t)(((steps)*0.068719476736)+0.5))	/* Acc/Dec rates conversion, range 14.55 to 59590 steps/s2 */
#define MaxSpd_Steps_to_Par(steps) ((uint16_t)(((steps)*0.065536)+0.5))			/* Max Speed conversion, range 15.25 to 15610 steps/s */
#define MinSpd_Steps_to_Par(steps) ((uint16_t)(((steps)*4.194304)+0.5))			/* Min Speed conversion, range 0 to 976.3 steps/s */
#define FSSpd_Steps_to_Par(steps) ((uint16_t)((steps)*0.065536))				/* Full Step Speed conversion, range 7.63 to 15625 steps/s */
#if defined(L6480)
#define IntSpd_Steps_to_Par(steps) ((uint16_t)(((steps)*4.194304)+0.5))			/* Intersect Speed conversion, range 0 to 3906 steps/s */
#define Kval_Perc_to_Par(perc) ((uint8_t)(((perc)/0.390625)+0.5))				/* KVAL conversions, range 0.4% to 99.6% */
#define BEMF_Slope_Perc_to_Par(perc) ((uint8_t)(((perc)/0.00156862745098)+0.5))	/* BEMF compensation slopes, range 0 to 0.4% s/step */
#define KTherm_to_Par(KTherm) ((uint8_t)(((KTherm - 1)/0.03125)+0.5))			/* K_THERM compensation conversion, range 1 to 1.46875 */
#define StallTh_to_Par(StallTh) ((uint8_t)(((StallTh - 31.25)/31.25)+0.5))		/* Stall Threshold conversion, range 31.25mV to 1000mV */
#endif /* defined(L6480) */
#if defined(L6482)
#define Tval_Current_to_Par(Tval) ((uint8_t)(((Tval - 7.8)/7.8)+0.5))       /* Torque regulation DAC current conversion, range 7.8mV to 1000mV */
#define Tmin_Time_to_Par(Tmin) ((uint8_t)(((Tmin - 0.5)*2)+0.5))                /* Minimum time conversion, range 0.5us to 64us */
#endif /* defined(L6482) */
#if defined(DEBUG)
#define CHECK_REG(reg, result) if (cSPIN_RegsStruct-> ## reg != cSPIN_Get_Param(cSPIN_ ## reg)) result |= 1 << ((uint8_t) cSPIN_ ## reg)
#define PRINT_REG(reg_name, read_reg, diff, reg_name_string)  strcpy(reg_name_string,"          "); \
  strncpy(reg_name_string, #reg_name, strlen(#reg_name)); \
  strcpy(diff," "); \
  read_reg = cSPIN_Get_Param(cSPIN_ ## reg_name); \
  if (read_reg != cSPIN_RegsStruct-> ## reg_name) strcpy(diff,"x"); \
  printf("%s %s mcu: 0x%-6X, cspin: 0x%-6X\n", diff, reg_name_string, cSPIN_RegsStruct-> ## reg_name, read_reg)
#endif /* defined(DEBUG) */
/* Exported functions ------------------------------------------------------- */

void cSPIN_Delay(__IO uint32_t nCount);
void cSPIN_Reset_And_Standby(void);
void cSPIN_Gpio_Toggle(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);
void cSPIN_Led_Check(void);
void cSPIN_Peripherals_Init(void);
void cSPIN_PWM_Enable(uint16_t Period);
void cSPIN_PWM_DISABLE(void); 
void cSPIN_Interrupt_Channel_Config(void);
void cSPIN_Flag_Interrupt_GPIO_Config(void);
void cSPIN_Busy_Interrupt_GPIO_Config(void);
void cSPIN_Busy_Interrupt_GPIO_DeConfig(void);
void cSPIN_Buttons_Interrupts_GPIO_Config(void);
void cSPIN_Switch_Motor_Interrupt_Config(void);
void cSPIN_Regs_Struct_Reset(cSPIN_RegsStruct_TypeDef* cSPIN_RegsStruct);
void cSPIN_Registers_Set(cSPIN_RegsStruct_TypeDef* cSPIN_RegsStruct);
#if defined(DEBUG) 
uint32_t cSPIN_Registers_Check(cSPIN_RegsStruct_TypeDef* cSPIN_RegsStruct);
void cSPIN_Registers_Get(cSPIN_RegsStruct_TypeDef* cSPIN_RegsStruct);
#endif /* defined(DEBUG) */
void cSPIN_Nop(void);
void cSPIN_Set_Param(cSPIN_Registers_TypeDef param, uint32_t value);
uint32_t cSPIN_Get_Param(cSPIN_Registers_TypeDef param);
void cSPIN_Run(cSPIN_Direction_TypeDef direction, uint32_t speed);
void cSPIN_Step_Clock(cSPIN_Direction_TypeDef direction);
void cSPIN_Move(cSPIN_Direction_TypeDef direction, uint32_t n_step);
void cSPIN_Go_To(uint32_t abs_pos);
void cSPIN_Go_To_Dir(cSPIN_Direction_TypeDef direction, uint32_t abs_pos);
void cSPIN_Go_Until(cSPIN_Action_TypeDef action, cSPIN_Direction_TypeDef direction, uint32_t speed);
void cSPIN_Release_SW(cSPIN_Action_TypeDef action, cSPIN_Direction_TypeDef direction);
void cSPIN_Go_Home(void);
void cSPIN_Go_Mark(void);
void cSPIN_Reset_Pos(void);
void cSPIN_Reset_Device(void);
void cSPIN_Soft_Stop(void);
void cSPIN_Hard_Stop(void);
void cSPIN_Soft_HiZ(void);
void cSPIN_Hard_HiZ(void);
uint16_t cSPIN_Get_Status(void);
uint8_t cSPIN_Busy_HW(void);
uint8_t cSPIN_Busy_SW(void);
uint8_t cSPIN_Flag(void);
uint8_t cSPIN_Write_Byte(uint8_t byte);
void cSPIN_Write_Daisy_Chain_Bytes(uint8_t *pTxByte, uint8_t *pRxByte, uint8_t nBytes);
void cSPIN_All_Slaves_Registers_Set(uint8_t slaves_number, cSPIN_RegsStruct_TypeDef *cSPIN_RegsStructArray);
void cSPIN_All_Slaves_Set_Param(uint8_t slaves_number, uint8_t *pParam, uint32_t *pValue);
void cSPIN_All_Slaves_Get_Param(uint8_t slaves_number, uint8_t *pParam, uint32_t *pValue);
void cSPIN_One_Slave_Move(uint8_t slaveNumber, uint8_t slaves_number, cSPIN_Direction_TypeDef direction, uint32_t n_step);
void cSPIN_One_Slave_Run(uint8_t slaveNumber, uint8_t slaves_number, cSPIN_Direction_TypeDef direction, uint32_t speed);
void cSPIN_One_Slave_Send_Command(uint8_t slaveNumber, uint8_t slaves_number, uint8_t param, uint32_t value);
void cSPIN_All_Slaves_Send_Command(uint8_t slaves_number, uint8_t *pParam, uint32_t *pValue);
void cSPIN_All_Slaves_Get_Status(uint8_t slaves_number, uint32_t *pValue);
uint8_t cSPIN_One_Or_More_Slaves_Busy_SW(uint8_t slaves_number);

extern cSPIN_RegsStruct_TypeDef cSPIN__RegsStructArray[NUMBER_OF_SLAVES];
extern double MAX_SPEED[NUMBER_OF_SLAVES];
extern uint8_t daisy_chain;
extern uint8_t number_of_slaves;  

#endif /* __CSPIN_H */

/******************* (C) COPYRIGHT 2013 STMicroelectronics *****END OF FILE****/
